package e_commerce;

/**
 * E-Commerce Application Project 
 * @author Ahmet Furkan Akdamar
 * 190316068   / II. Education
 */

public class E_commerce {

    
    public static void main(String[] args) {
        users u1 = new users("afa1453", "Furkan", "Akdamar", "20.06.2000", "dark1234", "furkan_1453@hotmail.com", "Ali Neighborhood 950th Street Süleymanpaşa/Tekirdağ",
                "Ahmet Neighborhood 1500th Street Süleymanpaşa/Tekirdağ", 3);
        product p1 = new product("Xiaomi Mi 8 ", "Blue", "Electronic", 20, 253.5, "Very smart new generation smartphone.");
        creditCard c1 = new creditCard("1234 1234 1234 1234", "Furkan Akdamar", 123, "12/28");
        order o1 = new order(u1,p1,c1);
        
        System.out.println("\n----------------------------------------------------------------------------------------------------------------");
        System.out.println("----------------------------------------------------------------------------------------------------------------");
        System.out.println("----------------------------------------------------------------------------------------------------------------");
        System.out.println("\n" + "                                     Welcome To The Shopping Site " + u1.getUserName() + " !");
        System.out.println("----------------------------------------------------------------------------------------------------------------");
        System.out.println("----------------------------------------------------------------------------------------------------------------");
        System.out.println("----------------------------------------------------------------------------------------------------------------\n");
        u1.writeAttributesUser();
        System.out.println("\n----------------------------------------------------------------------------------------------------------------\n");
        p1.writeAttributesProduct();
        System.out.println("\n----------------------------------------------------------------------------------------------------------------\n");
        c1.writeAttributesCard();
        System.out.println("\n----------------------------------------------------------------------------------------------------------------\n");

        
        
        u1.addCards(c1);
        System.out.println("\n----------------------------------------------------------------------------------------------------------------\n");
        u1.addProductFavorites(p1);
        System.out.println("\n----------------------------------------------------------------------------------------------------------------\n");
        u1.orderingProduct(p1,u1);
        System.out.println("\n----------------------------------------------------------------------------------------------------------------\n");
        p1.controlStock(u1);
        System.out.println("\n----------------------------------------------------------------------------------------------------------------\n");
        o1.accessToMethods(u1,p1);
        System.out.println("\n----------------------------------------------------------------------------------------------------------------\n");
        
        
    }
}
